Merge branch 'phase1-corrections'
